MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13276/mcu.h
// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x091);
#ifndef _LIB_BUILD
asm("PIR5 equ 091h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX2IF                  :1;
        unsigned RC2IF                  :1;
        unsigned SSP1IF                 :1;
        unsigned BCL1IF                 :1;
        unsigned SSP2IF                 :1;
        unsigned BCL2IF                 :1;
        unsigned CM1IF                  :1;
        unsigned CM2IF                  :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x091);
// bitfield macros
#define _PIR5_TX2IF_POSN                                    0x0
#define _PIR5_TX2IF_POSITION                                0x0
#define _PIR5_TX2IF_SIZE                                    0x1
#define _PIR5_TX2IF_LENGTH                                  0x1
#define _PIR5_TX2IF_MASK                                    0x1
#define _PIR5_RC2IF_POSN                                    0x1
#define _PIR5_RC2IF_POSITION                                0x1
#define _PIR5_RC2IF_SIZE                                    0x1
#define _PIR5_RC2IF_LENGTH                                  0x1
#define _PIR5_RC2IF_MASK                                    0x2
#define _PIR5_SSP1IF_POSN                                   0x2
#define _PIR5_SSP1IF_POSITION                               0x2
#define _PIR5_SSP1IF_SIZE                                   0x1
#define _PIR5_SSP1IF_LENGTH                                 0x1
#define _PIR5_SSP1IF_MASK                                   0x4
#define _PIR5_BCL1IF_POSN                                   0x3
#define _PIR5_BCL1IF_POSITION                               0x3
#define _PIR5_BCL1IF_SIZE                                   0x1
#define _PIR5_BCL1IF_LENGTH                                 0x1
#define _PIR5_BCL1IF_MASK                                   0x8
#define _PIR5_SSP2IF_POSN                                   0x4
#define _PIR5_SSP2IF_POSITION                               0x4
#define _PIR5_SSP2IF_SIZE                                   0x1
#define _PIR5_SSP2IF_LENGTH                                 0x1
#define _PIR5_SSP2IF_MASK                                   0x10
#define _PIR5_BCL2IF_POSN                                   0x5
#define _PIR5_BCL2IF_POSITION                               0x5
#define _PIR5_BCL2IF_SIZE                                   0x1
#define _PIR5_BCL2IF_LENGTH                                 0x1
#define _PIR5_BCL2IF_MASK                                   0x20
#define _PIR5_CM1IF_POSN                                    0x6
#define _PIR5_CM1IF_POSITION                                0x6
#define _PIR5_CM1IF_SIZE                                    0x1
#define _PIR5_CM1IF_LENGTH                                  0x1
#define _PIR5_CM1IF_MASK                                    0x40
#define _PIR5_CM2IF_POSN                                    0x7
#define _PIR5_CM2IF_POSITION                                0x7
#define _PIR5_CM2IF_SIZE                                    0x1
#define _PIR5_CM2IF_LENGTH                                  0x1
#define _PIR5_CM2IF_MASK                                    0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x092);
#ifndef _LIB_BUILD
asm("PIR6 equ 092h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
        unsigned                        :1;
        unsigned HLVDIF                 :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x092);
// bitfield macros
#define _PIR6_ADIF_POSN                                     0x0
#define _PIR6_ADIF_POSITION                                 0x0
#define _PIR6_ADIF_SIZE                                     0x1
#define _PIR6_ADIF_LENGTH                                   0x1
#define _PIR6_ADIF_MASK                                     0x1
#define _PIR6_ADTIF_POSN                                    0x1
#define _PIR6_ADTIF_POSITION                                0x1
#define _PIR6_ADTIF_SIZE                                    0x1
#define _PIR6_ADTIF_LENGTH                                  0x1
#define _PIR6_ADTIF_MASK                                    0x2
#define _PIR6_HLVDIF_POSN                                   0x3
#define _PIR6_HLVDIF_POSITION                               0x3
#define _PIR6_HLVDIF_SIZE                                   0x1
#define _PIR6_HLVDIF_LENGTH                                 0x1
#define _PIR6_HLVDIF_MASK                                   0x8

// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0x093);
#ifndef _LIB_BUILD
asm("PIR7 equ 093h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLB1IF0                :1;
        unsigned CLB1IF1                :1;
        unsigned CLB1IF2                :1;
        unsigned CLB1IF3                :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0x093);
// bitfield macros
#define _PIR7_CLB1IF0_POSN                                  0x0
#define _PIR7_CLB1IF0_POSITION                              0x0
#define _PIR7_CLB1IF0_SIZE                                  0x1
#define _PIR7_CLB1IF0_LENGTH                                0x1
#define _PIR7_CLB1IF0_MASK                                  0x1
#define _PIR7_CLB1IF1_POSN                                  0x1
#define _PIR7_CLB1IF1_POSITION                              0x1
#define _PIR7_CLB1IF1_SIZE                                  0x1
#define _PIR7_CLB1IF1_LENGTH                                0x1
#define _PIR7_CLB1IF1_MASK                                  0x2
#define _PIR7_CLB1IF2_POSN                                  0x2
#define _PIR7_CLB1IF2_POSITION                              0x2
#define _PIR7_CLB1IF2_SIZE                                  0x1
#define _PIR7_CLB1IF2_LENGTH                                0x1
#define _PIR7_CLB1IF2_MASK                                  0x4
#define _PIR7_CLB1IF3_POSN                                  0x3
#define _PIR7_CLB1IF3_POSITION                              0x3
#define _PIR7_CLB1IF3_SIZE                                  0x1
#define _PIR7_CLB1IF3_LENGTH                                0x1
#define _PIR7_CLB1IF3_MASK                                  0x8

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x096);
#ifndef _LIB_BUILD
asm("PIE0 equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTE                   :1;
        unsigned                        :3;
        unsigned IOCIE                  :1;
        unsigned TMR0IE                 :1;
    };
} PIE0bits_t;
