MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13276/mcu.h
// Register: TRISC4PPS
#define TRISC4PPS TRISC4PPS
extern volatile unsigned char           TRISC4PPS           __at(0x1DD4);
#ifndef _LIB_BUILD
asm("TRISC4PPS equ 01DD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC4PPS              :6;
    };
} TRISC4PPSbits_t;
extern volatile TRISC4PPSbits_t TRISC4PPSbits __at(0x1DD4);
// bitfield macros
#define _TRISC4PPS_TRISC4PPS_POSN                           0x0
#define _TRISC4PPS_TRISC4PPS_POSITION                       0x0
#define _TRISC4PPS_TRISC4PPS_SIZE                           0x6
#define _TRISC4PPS_TRISC4PPS_LENGTH                         0x6
#define _TRISC4PPS_TRISC4PPS_MASK                           0x3F

// Register: TRISC5PPS
#define TRISC5PPS TRISC5PPS
extern volatile unsigned char           TRISC5PPS           __at(0x1DD5);
#ifndef _LIB_BUILD
asm("TRISC5PPS equ 01DD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC5PPS              :6;
    };
} TRISC5PPSbits_t;
extern volatile TRISC5PPSbits_t TRISC5PPSbits __at(0x1DD5);
// bitfield macros
#define _TRISC5PPS_TRISC5PPS_POSN                           0x0
#define _TRISC5PPS_TRISC5PPS_POSITION                       0x0
#define _TRISC5PPS_TRISC5PPS_SIZE                           0x6
#define _TRISC5PPS_TRISC5PPS_LENGTH                         0x6
#define _TRISC5PPS_TRISC5PPS_MASK                           0x3F

// Register: TRISC6PPS
#define TRISC6PPS TRISC6PPS
extern volatile unsigned char           TRISC6PPS           __at(0x1DD6);
#ifndef _LIB_BUILD
asm("TRISC6PPS equ 01DD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC6PPS              :6;
    };
} TRISC6PPSbits_t;
extern volatile TRISC6PPSbits_t TRISC6PPSbits __at(0x1DD6);
// bitfield macros
#define _TRISC6PPS_TRISC6PPS_POSN                           0x0
#define _TRISC6PPS_TRISC6PPS_POSITION                       0x0
#define _TRISC6PPS_TRISC6PPS_SIZE                           0x6
#define _TRISC6PPS_TRISC6PPS_LENGTH                         0x6
#define _TRISC6PPS_TRISC6PPS_MASK                           0x3F

// Register: TRISC7PPS
#define TRISC7PPS TRISC7PPS
extern volatile unsigned char           TRISC7PPS           __at(0x1DD7);
#ifndef _LIB_BUILD
asm("TRISC7PPS equ 01DD7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC7PPS              :6;
    };
} TRISC7PPSbits_t;
extern volatile TRISC7PPSbits_t TRISC7PPSbits __at(0x1DD7);
// bitfield macros
#define _TRISC7PPS_TRISC7PPS_POSN                           0x0
#define _TRISC7PPS_TRISC7PPS_POSITION                       0x0
#define _TRISC7PPS_TRISC7PPS_SIZE                           0x6
#define _TRISC7PPS_TRISC7PPS_LENGTH                         0x6
#define _TRISC7PPS_TRISC7PPS_MASK                           0x3F

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0x1E0C);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 01E0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0x1E0C);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: INTPPS
#define INTPPS INTPPS
extern volatile unsigned char           INTPPS              __at(0x1E0D);
#ifndef _LIB_BUILD
asm("INTPPS equ 01E0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTPPS                 :7;
    };
} INTPPSbits_t;
extern volatile INTPPSbits_t INTPPSbits __at(0x1E0D);
// bitfield macros
#define _INTPPS_INTPPS_POSN                                 0x0
#define _INTPPS_INTPPS_POSITION                             0x0
#define _INTPPS_INTPPS_SIZE                                 0x7
#define _INTPPS_INTPPS_LENGTH                               0x7
#define _INTPPS_INTPPS_MASK                                 0x7F

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0x1E0E);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 01E0Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0CKIPPS               :7;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits __at(0x1E0E);
// bitfield macros
#define _T0CKIPPS_T0CKIPPS_POSN                             0x0
#define _T0CKIPPS_T0CKIPPS_POSITION                         0x0
#define _T0CKIPPS_T0CKIPPS_SIZE                             0x7
#define _T0CKIPPS_T0CKIPPS_LENGTH                           0x7
#define _T0CKIPPS_T0CKIPPS_MASK                             0x7F

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            __at(0x1E0F);
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 01E0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1CKIPPS               :7;
    };
} T1CKIPPSbits_t;
extern volatile T1CKIPPSbits_t T1CKIPPSbits __at(0x1E0F);
// bitfield macros
#define _T1CKIPPS_T1CKIPPS_POSN                             0x0
#define _T1CKIPPS_T1CKIPPS_POSITION                         0x0
#define _T1CKIPPS_T1CKIPPS_SIZE                             0x7
#define _T1CKIPPS_T1CKIPPS_LENGTH                           0x7
#define _T1CKIPPS_T1CKIPPS_MASK                             0x7F

// Register: T1GPPS
#define T1GPPS T1GPPS
extern volatile unsigned char           T1GPPS              __at(0x1E10);
#ifndef _LIB_BUILD
asm("T1GPPS equ 01E10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1GPPS                 :7;
    };
} T1GPPSbits_t;
extern volatile T1GPPSbits_t T1GPPSbits __at(0x1E10);
// bitfield macros
#define _T1GPPS_T1GPPS_POSN                                 0x0
#define _T1GPPS_T1GPPS_POSITION                             0x0
#define _T1GPPS_T1GPPS_SIZE                                 0x7
#define _T1GPPS_T1GPPS_LENGTH                               0x7
#define _T1GPPS_T1GPPS_MASK                                 0x7F

