MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13276/mcu.h
// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
extern volatile unsigned char           SSP1CLKPPS          __at(0x1E47);
#ifndef _LIB_BUILD
asm("SSP1CLKPPS equ 01E47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1CLKPPS             :7;
    };
} SSP1CLKPPSbits_t;
extern volatile SSP1CLKPPSbits_t SSP1CLKPPSbits __at(0x1E47);
// bitfield macros
#define _SSP1CLKPPS_SSP1CLKPPS_POSN                         0x0
#define _SSP1CLKPPS_SSP1CLKPPS_POSITION                     0x0
#define _SSP1CLKPPS_SSP1CLKPPS_SIZE                         0x7
#define _SSP1CLKPPS_SSP1CLKPPS_LENGTH                       0x7
#define _SSP1CLKPPS_SSP1CLKPPS_MASK                         0x7F

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
extern volatile unsigned char           SSP1DATPPS          __at(0x1E48);
#ifndef _LIB_BUILD
asm("SSP1DATPPS equ 01E48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1DATPPS             :7;
    };
} SSP1DATPPSbits_t;
extern volatile SSP1DATPPSbits_t SSP1DATPPSbits __at(0x1E48);
// bitfield macros
#define _SSP1DATPPS_SSP1DATPPS_POSN                         0x0
#define _SSP1DATPPS_SSP1DATPPS_POSITION                     0x0
#define _SSP1DATPPS_SSP1DATPPS_SIZE                         0x7
#define _SSP1DATPPS_SSP1DATPPS_LENGTH                       0x7
#define _SSP1DATPPS_SSP1DATPPS_MASK                         0x7F

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
extern volatile unsigned char           SSP1SSPPS           __at(0x1E49);
#ifndef _LIB_BUILD
asm("SSP1SSPPS equ 01E49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1SSPPS              :7;
    };
} SSP1SSPPSbits_t;
extern volatile SSP1SSPPSbits_t SSP1SSPPSbits __at(0x1E49);
// bitfield macros
#define _SSP1SSPPS_SSP1SSPPS_POSN                           0x0
#define _SSP1SSPPS_SSP1SSPPS_POSITION                       0x0
#define _SSP1SSPPS_SSP1SSPPS_SIZE                           0x7
#define _SSP1SSPPS_SSP1SSPPS_LENGTH                         0x7
#define _SSP1SSPPS_SSP1SSPPS_MASK                           0x7F

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
extern volatile unsigned char           SSP2CLKPPS          __at(0x1E4A);
#ifndef _LIB_BUILD
asm("SSP2CLKPPS equ 01E4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2CLKPPS             :7;
    };
} SSP2CLKPPSbits_t;
extern volatile SSP2CLKPPSbits_t SSP2CLKPPSbits __at(0x1E4A);
// bitfield macros
#define _SSP2CLKPPS_SSP2CLKPPS_POSN                         0x0
#define _SSP2CLKPPS_SSP2CLKPPS_POSITION                     0x0
#define _SSP2CLKPPS_SSP2CLKPPS_SIZE                         0x7
#define _SSP2CLKPPS_SSP2CLKPPS_LENGTH                       0x7
#define _SSP2CLKPPS_SSP2CLKPPS_MASK                         0x7F

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
extern volatile unsigned char           SSP2DATPPS          __at(0x1E4B);
#ifndef _LIB_BUILD
asm("SSP2DATPPS equ 01E4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2DATPPS             :7;
    };
} SSP2DATPPSbits_t;
extern volatile SSP2DATPPSbits_t SSP2DATPPSbits __at(0x1E4B);
// bitfield macros
#define _SSP2DATPPS_SSP2DATPPS_POSN                         0x0
#define _SSP2DATPPS_SSP2DATPPS_POSITION                     0x0
#define _SSP2DATPPS_SSP2DATPPS_SIZE                         0x7
#define _SSP2DATPPS_SSP2DATPPS_LENGTH                       0x7
#define _SSP2DATPPS_SSP2DATPPS_MASK                         0x7F

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
extern volatile unsigned char           SSP2SSPPS           __at(0x1E4C);
#ifndef _LIB_BUILD
asm("SSP2SSPPS equ 01E4Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2SSPPS              :7;
    };
} SSP2SSPPSbits_t;
extern volatile SSP2SSPPSbits_t SSP2SSPPSbits __at(0x1E4C);
// bitfield macros
#define _SSP2SSPPS_SSP2SSPPS_POSN                           0x0
#define _SSP2SSPPS_SSP2SSPPS_POSITION                       0x0
#define _SSP2SSPPS_SSP2SSPPS_SIZE                           0x7
#define _SSP2SSPPS_SSP2SSPPS_LENGTH                         0x7
#define _SSP2SSPPS_SSP2SSPPS_MASK                           0x7F

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
extern volatile unsigned char           ADACTPPS            __at(0x1E50);
#ifndef _LIB_BUILD
asm("ADACTPPS equ 01E50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACTPPS               :7;
    };
} ADACTPPSbits_t;
extern volatile ADACTPPSbits_t ADACTPPSbits __at(0x1E50);
// bitfield macros
#define _ADACTPPS_ADACTPPS_POSN                             0x0
#define _ADACTPPS_ADACTPPS_POSITION                         0x0
#define _ADACTPPS_ADACTPPS_SIZE                             0x7
#define _ADACTPPS_ADACTPPS_LENGTH                           0x7
#define _ADACTPPS_ADACTPPS_MASK                             0x7F

// Register: CLBCLKPPS
#define CLBCLKPPS CLBCLKPPS
extern volatile unsigned char           CLBCLKPPS           __at(0x1E57);
#ifndef _LIB_BUILD
asm("CLBCLKPPS equ 01E57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBCLKPPS              :7;
    };
} CLBCLKPPSbits_t;
extern volatile CLBCLKPPSbits_t CLBCLKPPSbits __at(0x1E57);
// bitfield macros
#define _CLBCLKPPS_CLBCLKPPS_POSN                           0x0
#define _CLBCLKPPS_CLBCLKPPS_POSITION                       0x0
#define _CLBCLKPPS_CLBCLKPPS_SIZE                           0x7
#define _CLBCLKPPS_CLBCLKPPS_LENGTH                         0x7
#define _CLBCLKPPS_CLBCLKPPS_MASK                           0x7F

// Register: CLBIN0PPS
#define CLBIN0PPS CLBIN0PPS
extern volatile unsigned char           CLBIN0PPS           __at(0x1E58);
#ifndef _LIB_BUILD
asm("CLBIN0PPS equ 01E58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBIN0PPS              :7;
    };
} CLBIN0PPSbits_t;
extern volatile CLBIN0PPSbits_t CLBIN0PPSbits __at(0x1E58);
// bitfield macros
#define _CLBIN0PPS_CLBIN0PPS_POSN                           0x0
#define _CLBIN0PPS_CLBIN0PPS_POSITION                       0x0
#define _CLBIN0PPS_CLBIN0PPS_SIZE                           0x7
#define _CLBIN0PPS_CLBIN0PPS_LENGTH                         0x7
#define _CLBIN0PPS_CLBIN0PPS_MASK                           0x7F

// Register: CLBIN1PPS
#define CLBIN1PPS CLBIN1PPS
extern volatile unsigned char           CLBIN1PPS           __at(0x1E59);
#ifndef _LIB_BUILD
asm("CLBIN1PPS equ 01E59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBIN1PPS              :7;
    };
} CLBIN1PPSbits_t;
extern volatile CLBIN1PPSbits_t CLBIN1PPSbits __at(0x1E59);
// bitfield macros
#define _CLBIN1PPS_CLBIN1PPS_POSN                           0x0
#define _CLBIN1PPS_CLBIN1PPS_POSITION                       0x0
#define _CLBIN1PPS_CLBIN1PPS_SIZE                           0x7
#define _CLBIN1PPS_CLBIN1PPS_LENGTH                         0x7
#define _CLBIN1PPS_CLBIN1PPS_MASK                           0x7F

// Register: CLBIN2PPS
#define CLBIN2PPS CLBIN2PPS
extern volatile unsigned char           CLBIN2PPS           __at(0x1E5A);
#ifndef _LIB_BUILD
asm("CLBIN2PPS equ 01E5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBIN2PPS              :7;
    };
} CLBIN2PPSbits_t;
extern volatile CLBIN2PPSbits_t CLBIN2PPSbits __at(0x1E5A);
// bitfield macros
#define _CLBIN2PPS_CLBIN2PPS_POSN                           0x0
#define _CLBIN2PPS_CLBIN2PPS_POSITION                       0x0
#define _CLBIN2PPS_CLBIN2PPS_SIZE                           0x7
#define _CLBIN2PPS_CLBIN2PPS_LENGTH                         0x7
#define _CLBIN2PPS_CLBIN2PPS_MASK                           0x7F

// Register: CLBIN3PPS
#define CLBIN3PPS CLBIN3PPS
extern volatile unsigned char           CLBIN3PPS           __at(0x1E5B);
#ifndef _LIB_BUILD
asm("CLBIN3PPS equ 01E5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBIN3PPS              :7;
    };
} CLBIN3PPSbits_t;
extern volatile CLBIN3PPSbits_t CLBIN3PPSbits __at(0x1E5B);
// bitfield macros
#define _CLBIN3PPS_CLBIN3PPS_POSN                           0x0
#define _CLBIN3PPS_CLBIN3PPS_POSITION                       0x0
#define _CLBIN3PPS_CLBIN3PPS_SIZE                           0x7
#define _CLBIN3PPS_CLBIN3PPS_LENGTH                         0x7
#define _CLBIN3PPS_CLBIN3PPS_MASK                           0x7F

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x1E8C);
#ifndef _LIB_BUILD
asm("ANSELA equ 01E8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELA0                :1;
        unsigned ANSELA1                :1;
        unsigned ANSELA2                :1;
        unsigned ANSELA3                :1;
        unsigned ANSELA4                :1;
        unsigned ANSELA5                :1;
        unsigned ANSEL6                 :1;
        unsigned ANSEL7                 :1;
    };
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned ANSA3                  :1;
        unsigned ANSA4                  :1;
        unsigned ANSA5                  :1;
        unsigned ANSA6                  :1;
        unsigned ANSA7                  :1;
    };
} ANSELAbits_t;
