MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13276/mcu.h
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x2095);	// @ (0x412 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x1062);	// @ (0x20C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x1063);	// @ (0x20C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// ADCG1A<CGA0>
extern volatile __bit                   CGA0                __at(0xE970);	// @ (0x1D2E * 8 + 0)
#define                                 CGA0_bit            _BIT_ACCESS(ADCG1A,0)
// ADCG1A<CGA1>
extern volatile __bit                   CGA1                __at(0xE971);	// @ (0x1D2E * 8 + 1)
#define                                 CGA1_bit            _BIT_ACCESS(ADCG1A,1)
// ADCG1A<CGA2>
extern volatile __bit                   CGA2                __at(0xE972);	// @ (0x1D2E * 8 + 2)
#define                                 CGA2_bit            _BIT_ACCESS(ADCG1A,2)
// ADCG1A<CGA3>
extern volatile __bit                   CGA3                __at(0xE973);	// @ (0x1D2E * 8 + 3)
#define                                 CGA3_bit            _BIT_ACCESS(ADCG1A,3)
// ADCG1A<CGA4>
extern volatile __bit                   CGA4                __at(0xE974);	// @ (0x1D2E * 8 + 4)
#define                                 CGA4_bit            _BIT_ACCESS(ADCG1A,4)
// ADCG1A<CGA5>
extern volatile __bit                   CGA5                __at(0xE975);	// @ (0x1D2E * 8 + 5)
#define                                 CGA5_bit            _BIT_ACCESS(ADCG1A,5)
// ADCG1A<CGA6>
extern volatile __bit                   CGA6                __at(0xE976);	// @ (0x1D2E * 8 + 6)
#define                                 CGA6_bit            _BIT_ACCESS(ADCG1A,6)
// ADCG1A<CGA7>
extern volatile __bit                   CGA7                __at(0xE977);	// @ (0x1D2E * 8 + 7)
#define                                 CGA7_bit            _BIT_ACCESS(ADCG1A,7)
// ADCG1B<CGB0>
extern volatile __bit                   CGB0                __at(0xE978);	// @ (0x1D2F * 8 + 0)
#define                                 CGB0_bit            _BIT_ACCESS(ADCG1B,0)
// ADCG1B<CGB1>
extern volatile __bit                   CGB1                __at(0xE979);	// @ (0x1D2F * 8 + 1)
#define                                 CGB1_bit            _BIT_ACCESS(ADCG1B,1)
// ADCG1B<CGB2>
extern volatile __bit                   CGB2                __at(0xE97A);	// @ (0x1D2F * 8 + 2)
#define                                 CGB2_bit            _BIT_ACCESS(ADCG1B,2)
// ADCG1B<CGB3>
extern volatile __bit                   CGB3                __at(0xE97B);	// @ (0x1D2F * 8 + 3)
#define                                 CGB3_bit            _BIT_ACCESS(ADCG1B,3)
// ADCG1B<CGB4>
extern volatile __bit                   CGB4                __at(0xE97C);	// @ (0x1D2F * 8 + 4)
#define                                 CGB4_bit            _BIT_ACCESS(ADCG1B,4)
// ADCG1B<CGB5>
extern volatile __bit                   CGB5                __at(0xE97D);	// @ (0x1D2F * 8 + 5)
#define                                 CGB5_bit            _BIT_ACCESS(ADCG1B,5)
// ADCG1B<CGB6>
extern volatile __bit                   CGB6                __at(0xE97E);	// @ (0x1D2F * 8 + 6)
#define                                 CGB6_bit            _BIT_ACCESS(ADCG1B,6)
// ADCG1B<CGB7>
extern volatile __bit                   CGB7                __at(0xE97F);	// @ (0x1D2F * 8 + 7)
#define                                 CGB7_bit            _BIT_ACCESS(ADCG1B,7)
// ADCG1C<CGC0>
extern volatile __bit                   CGC0                __at(0xE980);	// @ (0x1D30 * 8 + 0)
#define                                 CGC0_bit            _BIT_ACCESS(ADCG1C,0)
// ADCG1C<CGC1>
extern volatile __bit                   CGC1                __at(0xE981);	// @ (0x1D30 * 8 + 1)
#define                                 CGC1_bit            _BIT_ACCESS(ADCG1C,1)
// ADCG1C<CGC2>
extern volatile __bit                   CGC2                __at(0xE982);	// @ (0x1D30 * 8 + 2)
#define                                 CGC2_bit            _BIT_ACCESS(ADCG1C,2)
// ADCG1C<CGC3>
extern volatile __bit                   CGC3                __at(0xE983);	// @ (0x1D30 * 8 + 3)
#define                                 CGC3_bit            _BIT_ACCESS(ADCG1C,3)
// ADCG1C<CGC4>
extern volatile __bit                   CGC4                __at(0xE984);	// @ (0x1D30 * 8 + 4)
#define                                 CGC4_bit            _BIT_ACCESS(ADCG1C,4)
// ADCG1C<CGC5>
extern volatile __bit                   CGC5                __at(0xE985);	// @ (0x1D30 * 8 + 5)
#define                                 CGC5_bit            _BIT_ACCESS(ADCG1C,5)
// ADCG1C<CGC6>
extern volatile __bit                   CGC6                __at(0xE986);	// @ (0x1D30 * 8 + 6)
#define                                 CGC6_bit            _BIT_ACCESS(ADCG1C,6)
// ADCG1C<CGC7>
extern volatile __bit                   CGC7                __at(0xE987);	// @ (0x1D30 * 8 + 7)
#define                                 CGC7_bit            _BIT_ACCESS(ADCG1C,7)
// ADCG1D<CGD0>
extern volatile __bit                   CGD0                __at(0xE988);	// @ (0x1D31 * 8 + 0)
#define                                 CGD0_bit            _BIT_ACCESS(ADCG1D,0)
// ADCG1D<CGD1>
extern volatile __bit                   CGD1                __at(0xE989);	// @ (0x1D31 * 8 + 1)
#define                                 CGD1_bit            _BIT_ACCESS(ADCG1D,1)
// ADCG1D<CGD2>
extern volatile __bit                   CGD2                __at(0xE98A);	// @ (0x1D31 * 8 + 2)
#define                                 CGD2_bit            _BIT_ACCESS(ADCG1D,2)
// ADCG1D<CGD3>
extern volatile __bit                   CGD3                __at(0xE98B);	// @ (0x1D31 * 8 + 3)
#define                                 CGD3_bit            _BIT_ACCESS(ADCG1D,3)
// ADCG1D<CGD4>
extern volatile __bit                   CGD4                __at(0xE98C);	// @ (0x1D31 * 8 + 4)
#define                                 CGD4_bit            _BIT_ACCESS(ADCG1D,4)
// ADCG1D<CGD5>
extern volatile __bit                   CGD5                __at(0xE98D);	// @ (0x1D31 * 8 + 5)
#define                                 CGD5_bit            _BIT_ACCESS(ADCG1D,5)
// ADCG1D<CGD6>
extern volatile __bit                   CGD6                __at(0xE98E);	// @ (0x1D31 * 8 + 6)
#define                                 CGD6_bit            _BIT_ACCESS(ADCG1D,6)
// ADCG1D<CGD7>
extern volatile __bit                   CGD7                __at(0xE98F);	// @ (0x1D31 * 8 + 7)
#define                                 CGD7_bit            _BIT_ACCESS(ADCG1D,7)
// ADCG1E<CGE0>
extern volatile __bit                   CGE0                __at(0xE990);	// @ (0x1D32 * 8 + 0)
#define                                 CGE0_bit            _BIT_ACCESS(ADCG1E,0)
// ADCG1E<CGE1>
extern volatile __bit                   CGE1                __at(0xE991);	// @ (0x1D32 * 8 + 1)
#define                                 CGE1_bit            _BIT_ACCESS(ADCG1E,1)
// ADCG1E<CGE2>
extern volatile __bit                   CGE2                __at(0xE992);	// @ (0x1D32 * 8 + 2)
#define                                 CGE2_bit            _BIT_ACCESS(ADCG1E,2)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x3C7E);	// @ (0x78F * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x3CCE);	// @ (0x799 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x3C84);	// @ (0x790 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x3CD4);	// @ (0x79A * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// T0CON1<CKPS3>
extern volatile __bit                   CKPS3               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 CKPS3_bit           _BIT_ACCESS(T0CON1,3)
// PIE7<CLB1IE0>
extern volatile __bit                   CLB1IE0             __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 CLB1IE0_bit         _BIT_ACCESS(PIE7,0)
// PIE7<CLB1IE1>
extern volatile __bit                   CLB1IE1             __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 CLB1IE1_bit         _BIT_ACCESS(PIE7,1)
// PIE7<CLB1IE2>
extern volatile __bit                   CLB1IE2             __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CLB1IE2_bit         _BIT_ACCESS(PIE7,2)
// PIE7<CLB1IE3>
extern volatile __bit                   CLB1IE3             __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CLB1IE3_bit         _BIT_ACCESS(PIE7,3)
// PIR7<CLB1IF0>
extern volatile __bit                   CLB1IF0             __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 CLB1IF0_bit         _BIT_ACCESS(PIR7,0)
// PIR7<CLB1IF1>
extern volatile __bit                   CLB1IF1             __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 CLB1IF1_bit         _BIT_ACCESS(PIR7,1)
// PIR7<CLB1IF2>
extern volatile __bit                   CLB1IF2             __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 CLB1IF2_bit         _BIT_ACCESS(PIR7,2)
// PIR7<CLB1IF3>
extern volatile __bit                   CLB1IF3             __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 CLB1IF3_bit         _BIT_ACCESS(PIR7,3)
// CLBCON<CLBEN>
extern volatile __bit                   CLBEN               __at(0x2867);	// @ (0x50C * 8 + 7)
#define                                 CLBEN_bit           _BIT_ACCESS(CLBCON,7)
// PMD4<CLBMD>
extern volatile __bit                   CLBMD               __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 CLBMD_bit           _BIT_ACCESS(PMD4,7)
// CLBSWINL<CLBSWIN0>
extern volatile __bit                   CLBSWIN0            __at(0x2880);	// @ (0x510 * 8 + 0)
#define                                 CLBSWIN0_bit        _BIT_ACCESS(CLBSWINL,0)
// CLBSWINL<CLBSWIN1>
extern volatile __bit                   CLBSWIN1            __at(0x2881);	// @ (0x510 * 8 + 1)
#define                                 CLBSWIN1_bit        _BIT_ACCESS(CLBSWINL,1)
// CLBSWINM<CLBSWIN10>
extern volatile __bit                   CLBSWIN10           __at(0x287A);	// @ (0x50F * 8 + 2)
#define                                 CLBSWIN10_bit       _BIT_ACCESS(CLBSWINM,2)
// CLBSWINM<CLBSWIN11>
extern volatile __bit                   CLBSWIN11           __at(0x287B);	// @ (0x50F * 8 + 3)
#define                                 CLBSWIN11_bit       _BIT_ACCESS(CLBSWINM,3)
// CLBSWINM<CLBSWIN12>
extern volatile __bit                   CLBSWIN12           __at(0x287C);	// @ (0x50F * 8 + 4)
#define                                 CLBSWIN12_bit       _BIT_ACCESS(CLBSWINM,4)
// CLBSWINM<CLBSWIN13>
extern volatile __bit                   CLBSWIN13           __at(0x287D);	// @ (0x50F * 8 + 5)
#define                                 CLBSWIN13_bit       _BIT_ACCESS(CLBSWINM,5)
// CLBSWINM<CLBSWIN14>
extern volatile __bit                   CLBSWIN14           __at(0x287E);	// @ (0x50F * 8 + 6)
#define                                 CLBSWIN14_bit       _BIT_ACCESS(CLBSWINM,6)
// CLBSWINM<CLBSWIN15>
extern volatile __bit                   CLBSWIN15           __at(0x287F);	// @ (0x50F * 8 + 7)
#define                                 CLBSWIN15_bit       _BIT_ACCESS(CLBSWINM,7)
// CLBSWINH<CLBSWIN16>
extern volatile __bit                   CLBSWIN16           __at(0x2870);	// @ (0x50E * 8 + 0)
#define                                 CLBSWIN16_bit       _BIT_ACCESS(CLBSWINH,0)
// CLBSWINH<CLBSWIN17>
extern volatile __bit                   CLBSWIN17           __at(0x2871);	// @ (0x50E * 8 + 1)
#define                                 CLBSWIN17_bit       _BIT_ACCESS(CLBSWINH,1)
// CLBSWINH<CLBSWIN18>
extern volatile __bit                   CLBSWIN18           __at(0x2872);	// @ (0x50E * 8 + 2)
#define                                 CLBSWIN18_bit       _BIT_ACCESS(CLBSWINH,2)
// CLBSWINH<CLBSWIN19>
extern volatile __bit                   CLBSWIN19           __at(0x2873);	// @ (0x50E * 8 + 3)
#define                                 CLBSWIN19_bit       _BIT_ACCESS(CLBSWINH,3)
// CLBSWINL<CLBSWIN2>
extern volatile __bit                   CLBSWIN2            __at(0x2882);	// @ (0x510 * 8 + 2)
#define                                 CLBSWIN2_bit        _BIT_ACCESS(CLBSWINL,2)
// CLBSWINH<CLBSWIN20>
extern volatile __bit                   CLBSWIN20           __at(0x2874);	// @ (0x50E * 8 + 4)
#define                                 CLBSWIN20_bit       _BIT_ACCESS(CLBSWINH,4)
// CLBSWINH<CLBSWIN21>
extern volatile __bit                   CLBSWIN21           __at(0x2875);	// @ (0x50E * 8 + 5)
#define                                 CLBSWIN21_bit       _BIT_ACCESS(CLBSWINH,5)
// CLBSWINH<CLBSWIN22>
extern volatile __bit                   CLBSWIN22           __at(0x2876);	// @ (0x50E * 8 + 6)
#define                                 CLBSWIN22_bit       _BIT_ACCESS(CLBSWINH,6)
// CLBSWINH<CLBSWIN23>
extern volatile __bit                   CLBSWIN23           __at(0x2877);	// @ (0x50E * 8 + 7)
#define                                 CLBSWIN23_bit       _BIT_ACCESS(CLBSWINH,7)
// CLBSWINU<CLBSWIN24>
extern volatile __bit                   CLBSWIN24           __at(0x2868);	// @ (0x50D * 8 + 0)
#define                                 CLBSWIN24_bit       _BIT_ACCESS(CLBSWINU,0)
// CLBSWINU<CLBSWIN25>
extern volatile __bit                   CLBSWIN25           __at(0x2869);	// @ (0x50D * 8 + 1)
#define                                 CLBSWIN25_bit       _BIT_ACCESS(CLBSWINU,1)
// CLBSWINU<CLBSWIN26>
extern volatile __bit                   CLBSWIN26           __at(0x286A);	// @ (0x50D * 8 + 2)
#define                                 CLBSWIN26_bit       _BIT_ACCESS(CLBSWINU,2)
// CLBSWINU<CLBSWIN27>
extern volatile __bit                   CLBSWIN27           __at(0x286B);	// @ (0x50D * 8 + 3)
#define                                 CLBSWIN27_bit       _BIT_ACCESS(CLBSWINU,3)
// CLBSWINU<CLBSWIN28>
extern volatile __bit                   CLBSWIN28           __at(0x286C);	// @ (0x50D * 8 + 4)
#define                                 CLBSWIN28_bit       _BIT_ACCESS(CLBSWINU,4)
// CLBSWINU<CLBSWIN29>
extern volatile __bit                   CLBSWIN29           __at(0x286D);	// @ (0x50D * 8 + 5)
#define                                 CLBSWIN29_bit       _BIT_ACCESS(CLBSWINU,5)
// CLBSWINL<CLBSWIN3>
extern volatile __bit                   CLBSWIN3            __at(0x2883);	// @ (0x510 * 8 + 3)
#define                                 CLBSWIN3_bit        _BIT_ACCESS(CLBSWINL,3)
// CLBSWINU<CLBSWIN30>
extern volatile __bit                   CLBSWIN30           __at(0x286E);	// @ (0x50D * 8 + 6)
#define                                 CLBSWIN30_bit       _BIT_ACCESS(CLBSWINU,6)
// CLBSWINU<CLBSWIN31>
extern volatile __bit                   CLBSWIN31           __at(0x286F);	// @ (0x50D * 8 + 7)
#define                                 CLBSWIN31_bit       _BIT_ACCESS(CLBSWINU,7)
// CLBSWINL<CLBSWIN4>
extern volatile __bit                   CLBSWIN4            __at(0x2884);	// @ (0x510 * 8 + 4)
#define                                 CLBSWIN4_bit        _BIT_ACCESS(CLBSWINL,4)
// CLBSWINL<CLBSWIN5>
extern volatile __bit                   CLBSWIN5            __at(0x2885);	// @ (0x510 * 8 + 5)
#define                                 CLBSWIN5_bit        _BIT_ACCESS(CLBSWINL,5)
// CLBSWINL<CLBSWIN6>
extern volatile __bit                   CLBSWIN6            __at(0x2886);	// @ (0x510 * 8 + 6)
#define                                 CLBSWIN6_bit        _BIT_ACCESS(CLBSWINL,6)
// CLBSWINL<CLBSWIN7>
extern volatile __bit                   CLBSWIN7            __at(0x2887);	// @ (0x510 * 8 + 7)
#define                                 CLBSWIN7_bit        _BIT_ACCESS(CLBSWINL,7)
// CLBSWINM<CLBSWIN8>
extern volatile __bit                   CLBSWIN8            __at(0x2878);	// @ (0x50F * 8 + 0)
#define                                 CLBSWIN8_bit        _BIT_ACCESS(CLBSWINM,0)
// CLBSWINM<CLBSWIN9>
extern volatile __bit                   CLBSWIN9            __at(0x2879);	// @ (0x50F * 8 + 1)
#define                                 CLBSWIN9_bit        _BIT_ACCESS(CLBSWINM,1)
// CLBSWOUTL<CLBSWOUT0>
extern volatile __bit                   CLBSWOUT0           __at(0x28B8);	// @ (0x517 * 8 + 0)
#define                                 CLBSWOUT0_bit       _BIT_ACCESS(CLBSWOUTL,0)
// CLBSWOUTL<CLBSWOUT1>
extern volatile __bit                   CLBSWOUT1           __at(0x28B9);	// @ (0x517 * 8 + 1)
#define                                 CLBSWOUT1_bit       _BIT_ACCESS(CLBSWOUTL,1)
// CLBSWOUTH<CLBSWOUT10>
extern volatile __bit                   CLBSWOUT10          __at(0x28B2);	// @ (0x516 * 8 + 2)
#define                                 CLBSWOUT10_bit      _BIT_ACCESS(CLBSWOUTH,2)
// CLBSWOUTH<CLBSWOUT11>
extern volatile __bit                   CLBSWOUT11          __at(0x28B3);	// @ (0x516 * 8 + 3)
#define                                 CLBSWOUT11_bit      _BIT_ACCESS(CLBSWOUTH,3)
// CLBSWOUTH<CLBSWOUT12>
extern volatile __bit                   CLBSWOUT12          __at(0x28B4);	// @ (0x516 * 8 + 4)
#define                                 CLBSWOUT12_bit      _BIT_ACCESS(CLBSWOUTH,4)
// CLBSWOUTH<CLBSWOUT13>
extern volatile __bit                   CLBSWOUT13          __at(0x28B5);	// @ (0x516 * 8 + 5)
#define                                 CLBSWOUT13_bit      _BIT_ACCESS(CLBSWOUTH,5)
// CLBSWOUTH<CLBSWOUT14>
extern volatile __bit                   CLBSWOUT14          __at(0x28B6);	// @ (0x516 * 8 + 6)
#define                                 CLBSWOUT14_bit      _BIT_ACCESS(CLBSWOUTH,6)
// CLBSWOUTH<CLBSWOUT15>
extern volatile __bit                   CLBSWOUT15          __at(0x28B7);	// @ (0x516 * 8 + 7)
#define                                 CLBSWOUT15_bit      _BIT_ACCESS(CLBSWOUTH,7)
// CLBSWOUTL<CLBSWOUT2>
extern volatile __bit                   CLBSWOUT2           __at(0x28BA);	// @ (0x517 * 8 + 2)
#define                                 CLBSWOUT2_bit       _BIT_ACCESS(CLBSWOUTL,2)
// CLBSWOUTL<CLBSWOUT3>
extern volatile __bit                   CLBSWOUT3           __at(0x28BB);	// @ (0x517 * 8 + 3)
#define                                 CLBSWOUT3_bit       _BIT_ACCESS(CLBSWOUTL,3)
// CLBSWOUTL<CLBSWOUT4>
extern volatile __bit                   CLBSWOUT4           __at(0x28BC);	// @ (0x517 * 8 + 4)
#define                                 CLBSWOUT4_bit       _BIT_ACCESS(CLBSWOUTL,4)
// CLBSWOUTL<CLBSWOUT5>
extern volatile __bit                   CLBSWOUT5           __at(0x28BD);	// @ (0x517 * 8 + 5)
#define                                 CLBSWOUT5_bit       _BIT_ACCESS(CLBSWOUTL,5)
// CLBSWOUTL<CLBSWOUT6>
extern volatile __bit                   CLBSWOUT6           __at(0x28BE);	// @ (0x517 * 8 + 6)
#define                                 CLBSWOUT6_bit       _BIT_ACCESS(CLBSWOUTL,6)
// CLBSWOUTL<CLBSWOUT7>
extern volatile __bit                   CLBSWOUT7           __at(0x28BF);	// @ (0x517 * 8 + 7)
#define                                 CLBSWOUT7_bit       _BIT_ACCESS(CLBSWOUTL,7)
// CLBSWOUTH<CLBSWOUT8>
extern volatile __bit                   CLBSWOUT8           __at(0x28B0);	// @ (0x516 * 8 + 0)
#define                                 CLBSWOUT8_bit       _BIT_ACCESS(CLBSWOUTH,0)
// CLBSWOUTH<CLBSWOUT9>
extern volatile __bit                   CLBSWOUT9           __at(0x28B1);	// @ (0x516 * 8 + 1)
#define                                 CLBSWOUT9_bit       _BIT_ACCESS(CLBSWOUTH,1)
// PIE4<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x482);	// @ (0x90 * 8 + 2)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR4,2)
// PMD2<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x875);	// @ (0x10E * 8 + 5)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD2,5)
// CLCDATA<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0x34B8);	// @ (0x697 * 8 + 0)
#define                                 CLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// PIE4<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR4,3)
// PMD2<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x876);	// @ (0x10E * 8 + 6)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD2,6)
// CLCDATA<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0x34B9);	// @ (0x697 * 8 + 1)
#define                                 CLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// PIE4<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x484);	// @ (0x90 * 8 + 4)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR4,4)
// PMD2<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x877);	// @ (0x10E * 8 + 7)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD2,7)
// CLCDATA<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 CLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// PIE4<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR4,5)
// PMD3<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x878);	// @ (0x10F * 8 + 0)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD3,0)
// CLCDATA<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// CLBCLK<CLK4>
